FemDesign.RestrictedInteger
Contains integer restrictions used for property definitions.
Restrictions are defined by strusoft.xsd

FemDesign.RestrictedInteger.ValueInRange(System.Int32,System.Int32,System.Int32)
Check if val in range (min, max)

FemDesign.RestrictedInteger.TimberServiceClass(System.Int32)
timber_service_class